wiki/JAVA.org
#+TITLE:       JAVA.org
#+AUTHOR:      Will Chang
#+EMAIL:       changwei.cn@gmail.com
#+DATE:        2013-12-19 Thu
#+URI:         /wiki/html/java
#+KEYWORDS:    java
#+TAGS:        :java:
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION:  Java Tips
     


* cxf工具生成webservice客户端方法

1、用CXF的wsdl2java.bat自动生成客户端： 
1）、首先，需要在wsdl2java.bat中以下两个变量：（可以添加到文件最后）
<#+BEGIN_SRC >
set CXF_HOME=D:\资料文件-limpo\apache-cxf-2.2.7\apache-cxf-2.2.7
set JAVA_HOME=C:\Program Files\Java\jdk1.6.0_01
</#+BEGIN_SRC >
  也就是设置你的cxf地址和jdk地址，除了以上两个，你还需要在jdk安装目录下的jre/lib下新建endorsed目录，再把jaxb-api-2.1.jar拷贝到其中，因为cxf在jdk1.6下运行，需要这个包。
2）、接着，用cmd命令，进到cxf下的bin目录，例：D:\cxf\apache-cxf-2.3.1\bin 。然后再输入：
<#+BEGIN_SRC >
就可以了。
-p后的com.jd.emall.rpc.server.wares 指的是生成的java文件的包路径。
-d后的d:/指的是文件生成的本地路径。
最后的uri指的是wsdl的访问地址。
2、客户端配置：
<#+BEGIN_SRC ">
<beans xmlns="http://www.springframework.org/schema/beans"
       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
       xmlns:jaxws="http://cxf.apache.org/jaxws"
       xsi:schemaLocation="http://www.springframework.org/schema/beans http://www.springframework.org/schema/beans/spring-beans.xsd
       http://cxf.apache.org/jaxws http://cxf.apache.org/schemas/jaxws.xsd">
    
      <import resource="classpath:META-INF/cxf/cxf.xml" />
<import resource="classpath:META-INF/cxf/cxf-extension-soap.xml" />
      <import resource="classpath:META-INF/cxf/cxf-servlet.xml" />
<jaxws:client id="wareServicer"
address="${webservice.address.ware}"
serviceClass="com.jd.emall.rpc.server.wares.EbookQueryInfoWsService">
</jaxws:client>
<jaxws:client id="categoryServicer"
address="${webservice.address.category}"
serviceClass="com.jd.emall.rpc.server.category.CategoryWebService">
</jaxws:client>
</beans>   
</#+BEGIN_SRC >
properties文件加入以下配置： 
<#+BEGIN_SRC >
#商品信息外部接口地址
webservice.address.ware=http://admin.ebook.360buy.net/services/services/ebookQueryWs
#商品分类外部接口地址
webservice.address.category=http://10.10.224.38:8080/product-bss-web/services/categoryWebService
 </#+BEGIN_SRC >
3、可能遇到的问题：
1）、生成的文件中可能由于java6与 cxf 版本问题报Service类的几个构造方法未定义，解决方法是: 
<#+BEGIN_SRC >
D:\cxf>wsdl2java -p com.naver.usalife.ws.client -frontend jaxws21  -client  http://localhost:8080/ws/helloworld?wsdl
</#+BEGIN_SRC >

请增加 -frontend jaxws21  
2）、可能你在web中集成spring和cxf时也会遇到2个jax*版本不一致的问题
请在web工程中获得 System.out.println(System.getProperty("java.endorsed.dirs")); 所在路径，然后将附件中的两个jar添加到获得的路径中。
如果文件夹不存在，请手动创建文件夹。

<#+BEGIN_SRC >
wsdl2java -p  com.jd.pbs.ws.brandrelationinfo  -d d:/ http://service.vm.360buy.com/services/soap/xml/brandrelationinfo?wsdl
</#+BEGIN_SRC >

