wiki/java/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>JAVA.org - Keep going</title>
    <meta charset="utf-8" />
    <meta name="author" content="U-360BUYAD\changwei" />
    <meta name="description" content="Java Tips" />
    <meta name="keywords" content="java" />
    <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  </head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="/">Keep going</a></h1>
        <p>努力超越自己！</p>
        <ul>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/media/">Media</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/wiki/">Wiki</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/standino">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="http://www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="q" value="site:standino.github.io">
        </form>
      </header>
    </div>

<div>
<div class="post">
<h1>JAVA.org</h1>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">cxf工具生成webservice客户端方法</h2>
<div class="outline-text-2" id="text-1">
<p>
1、用CXF的wsdl2java.bat自动生成客户端： 
1）、首先，需要在wsdl2java.bat中以下两个变量：（可以添加到文件最后）
&lt;src&gt;
set CXF_HOME=D:\资料文件-limpo\apache-cxf-2.2.7\apache-cxf-2.2.7
set JAVA_HOME=C:\Program Files\Java\jdk1.6.0_01
&lt;/src&gt;
  也就是设置你的cxf地址和jdk地址，除了以上两个，你还需要在jdk安装目录下的jre/lib下新建endorsed目录，再把jaxb-api-2.1.jar拷贝到其中，因为cxf在jdk1.6下运行，需要这个包。
2）、接着，用cmd命令，进到cxf下的bin目录，例：D:\cxf\apache-cxf-2.3.1\bin 。然后再输入：
&lt;src&gt;wsdl2java -p  com.jd.emall.rpc.server.wares  -d d:/ <a href="http://admin.ebook.360buy.net/services/services/ebookQueryWs?wsdl">http://admin.ebook.360buy.net/services/services/ebookQueryWs?wsdl</a>  &lt;/src&gt;
就可以了。
-p后的com.jd.emall.rpc.server.wares 指的是生成的java文件的包路径。
-d后的d:/指的是文件生成的本地路径。
最后的uri指的是wsdl的访问地址。
2、客户端配置：
&lt;src lang="xml"&gt;
&lt;beans xmlns="<a href="http://www.springframework.org/schema/beans">http://www.springframework.org/schema/beans</a>"
       xmlns:xsi="<a href="http://www.w3.org/2001/XMLSchema-instance">http://www.w3.org/2001/XMLSchema-instance</a>"
       xmlns:jaxws="<a href="http://cxf.apache.org/jaxws">http://cxf.apache.org/jaxws</a>"
       xsi:schemaLocation="<a href="http://www.springframework.org/schema/beans">http://www.springframework.org/schema/beans</a> <a href="http://www.springframework.org/schema/beans/spring-beans.xsd">http://www.springframework.org/schema/beans/spring-beans.xsd</a>
       <a href="http://cxf.apache.org/jaxws">http://cxf.apache.org/jaxws</a> <a href="http://cxf.apache.org/schemas/jaxws.xsd">http://cxf.apache.org/schemas/jaxws.xsd</a>"&gt;
</p>

<p>
      &lt;import resource="classpath:META-INF/cxf/cxf.xml" /&gt;
&lt;import resource="classpath:META-INF/cxf/cxf-extension-soap.xml" /&gt;
      &lt;import resource="classpath:META-INF/cxf/cxf-servlet.xml" /&gt;
&lt;jaxws:client id="wareServicer"
address="${webservice.address.ware}"
serviceClass="com.jd.emall.rpc.server.wares.EbookQueryInfoWsService"&gt;
&lt;/jaxws:client&gt;
&lt;jaxws:client id="categoryServicer"
address="${webservice.address.category}"
serviceClass="com.jd.emall.rpc.server.category.CategoryWebService"&gt;
&lt;/jaxws:client&gt;
&lt;/beans&gt;   
&lt;/src&gt;
properties文件加入以下配置： 
&lt;src&gt;
#商品信息外部接口地址
webservice.address.ware=<a href="http://admin.ebook.360buy.net/services/services/ebookQueryWs">http://admin.ebook.360buy.net/services/services/ebookQueryWs</a>
#商品分类外部接口地址
webservice.address.category=<a href="http://10.10.224.38:8080/product-bss-web/services/categoryWebService">http://10.10.224.38:8080/product-bss-web/services/categoryWebService</a>
 &lt;/src&gt;
3、可能遇到的问题：
1）、生成的文件中可能由于java6与 cxf 版本问题报Service类的几个构造方法未定义，解决方法是: 
&lt;src&gt;
D:\cxf&gt;wsdl2java -p com.naver.usalife.ws.client -frontend jaxws21  -client  <a href="http://localhost:8080/ws/helloworld?wsdl">http://localhost:8080/ws/helloworld?wsdl</a>
&lt;/src&gt;
</p>

<p>
请增加 -frontend jaxws21  
2）、可能你在web中集成spring和cxf时也会遇到2个jax*版本不一致的问题
请在web工程中获得 System.out.println(System.getProperty("java.endorsed.dirs")); 所在路径，然后将附件中的两个jar添加到获得的路径中。
如果文件夹不存在，请手动创建文件夹。
</p>

<p>
&lt;src&gt;
wsdl2java -p  com.jd.pbs.ws.brandrelationinfo  -d d:/ <a href="http://service.vm.360buy.com/services/soap/xml/brandrelationinfo?wsdl">http://service.vm.360buy.com/services/soap/xml/brandrelationinfo?wsdl</a>
&lt;/src&gt;
</p>
</div>
</div>
